## Pandas Series
Pandas is an one - dimensional labled array capable for holding any data type.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([11,12,13])
dic = {'Name':'Sneha','Age':19,'Topic':'Pandas'}

In [3]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(arr,labels)

a    11
b    12
c    13
dtype: int64

In [5]:
pd.Series(dic) #Note:Here key is itself index if we try to give index manually it gives error !

Name      Sneha
Age          19
Topic    Pandas
dtype: object

## Pandas DataFrame
DataFrame is two-dimensional, tabular data structure with labeled rows and columns.

In [6]:
#DataFrame using Dictionary
data={
    'Name':['Sneha','Ruhi','Kajal','Tanish','Rohit','Anshika'],
    'Age':[19,20,21,15,18,15],
    'Department':['DS','AI','ML','DL','DS','ML']
}

df=pd.DataFrame(data)
print(df)

      Name  Age Department
0    Sneha   19         DS
1     Ruhi   20         AI
2    Kajal   21         ML
3   Tanish   15         DL
4    Rohit   18         DS
5  Anshika   15         ML

In [7]:
#DataFrame using Nested List
temp_data=[
    ['Sneha',19,'DS'],
    ['Tanish',20,'AI'],
    ['Aarohi',21,'ML']
]
df2=pd.DataFrame(temp_data,columns=['Name','Age','Department']) 
print(df2) #Note: Here default index for rows and column (0,1,2...)

     Name  Age Department
0   Sneha   19         DS
1  Tanish   20         AI
2  Aarohi   21         ML

In [8]:
#Selection Column
print(df['Name'])
print("\n")
print(df[['Name','Department']])

0      Sneha
1       Ruhi
2      Kajal
3     Tanish
4      Rohit
5    Anshika
Name: Name, dtype: object


      Name Department
0    Sneha         DS
1     Ruhi         AI
2    Kajal         ML
3   Tanish         DL
4    Rohit         DS
5  Anshika         ML

In [9]:
#Add Column
df['Location']=['Pune','Delhi','Mumbai','Pune','Delhi','Mumbai']
print(df)

      Name  Age Department Location
0    Sneha   19         DS     Pune
1     Ruhi   20         AI    Delhi
2    Kajal   21         ML   Mumbai
3   Tanish   15         DL     Pune
4    Rohit   18         DS    Delhi
5  Anshika   15         ML   Mumbai

In [10]:
#Remove Column
#df.drop('Location') ''' It Gives Error axix is must !'''
df.drop('Location',axis=1) #It just show that how table looks after deletion on coulm it doesn't remove coulmn permamently !
df.drop('Location',axis=1,inplace=True)
df.drop(['Age','Department'],axis=1)

      Name
0    Sneha
1     Ruhi
2    Kajal
3   Tanish
4    Rohit
5  Anshika

In [11]:
#Remove Row
df.drop(0,axis=0,inplace=True) #Give index for row deletion if custom is given then use that otherwise default index is used !
df.drop([1,3]) #Here the default axix=0 for row

      Name  Age Department
2    Kajal   21         ML
4    Rohit   18         DS
5  Anshika   15         ML

In [12]:
#Selecting Rows and Column in Data Frame
# loc vs iloc

In [13]:
#Selecting subset of DataFrame
df.loc[[1,2]][['Name','Age']]

    Name  Age
1   Ruhi   20
2  Kajal   21

Conditional Selection

In [14]:
#Select the peoples who can vote
df[df["Age"]>=18]

    Name  Age Department
1   Ruhi   20         AI
2  Kajal   21         ML
4  Rohit   18         DS

In [15]:
#Select with age<15 and Department=ML
df[(df["Age"]<18) & (df["Department"]=="ML")]

      Name  Age Department
5  Anshika   15         ML